FWIW - I'm going to assume either a bug or corrupted state and forcefully recreate it:

```
$ terraform apply -replace='module.topic["products"].confluent_schema.schema'

... redacted ...

Terraform will perform the following actions:

  # module.topic["products"].confluent_schema.schema will be replaced, as requested
-/+ resource "confluent_schema" "schema" {
      ~ id                 = "lsrc-9kw3nm/rtl-lifecycle.dev.public.products-value/latest" -> (known after apply)
      ~ schema_identifier  = 100742 -> (known after apply)
      ~ version            = 2 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

... redacted ...

module.topic["products"].confluent_schema.schema: Destroying... [id=lsrc-9kw3nm/rtl-lifecycle.dev.public.products-value/latest]
module.topic["products"].confluent_schema.schema: Still destroying... [id=lsrc-9kw3nm/rtl-lifecycle.dev.public.products-value/latest, 11s elapsed]
module.topic["products"].confluent_schema.schema: Destruction complete after 12s
module.topic["products"].confluent_schema.schema: Creating...
module.topic["products"].confluent_schema.schema: Still creating... [9s elapsed]
module.topic["products"].confluent_schema.schema: Creation complete after 16s [id=lsrc-9kw3nm/rtl-lifecycle.dev.public.products-value/latest]

... redacted ...

```
